Revit 2015 API
BoundarySegmentArray Class
An array that contains boundary segments.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class BoundarySegmentArray : APIObject,
	IEnumerable
Visual Basic
Public Class BoundarySegmentArray _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class BoundarySegmentArray : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Architecture.BoundarySegmentArray
See Also
BoundarySegmentArray Members
Autodesk.Revit.DB.Architecture Namespace